Model: "autoencoder"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 334, 1)]          0         
                                                                 
 flatten (Flatten)           (None, 334)               0         
                                                                 
 dense (Dense)               (None, 42)                14070     
                                                                 
 dense_1 (Dense)             (None, 42)                1806      
                                                                 
 dense_2 (Dense)             (None, 334)               14362     
                                                                 
 reshape (Reshape)           (None, 334, 1)            0         
                                                                 
=================================================================
Total params: 30,238
Trainable params: 30,238
Non-trainable params: 0
_________________________________________________________________
   1/2826 [..............................] - ETA: 6:46 - loss: 0.2669 143/2826 [>.............................] - ETA: 0s - loss: 0.3545   281/2826 [=>............................] - ETA: 0s - loss: 0.3213 419/2826 [===>..........................] - ETA: 0s - loss: 0.3068 556/2826 [====>.........................] - ETA: 0s - loss: 0.2994 696/2826 [======>.......................] - ETA: 0s - loss: 0.2937 831/2826 [=======>......................] - ETA: 0s - loss: 0.2925 957/2826 [=========>....................] - ETA: 0s - loss: 0.28891091/2826 [==========>...................] - ETA: 0s - loss: 0.28671230/2826 [============>.................] - ETA: 0s - loss: 0.28381369/2826 [=============>................] - ETA: 0s - loss: 0.27961508/2826 [===============>..............] - ETA: 0s - loss: 0.27471646/2826 [================>.............] - ETA: 0s - loss: 0.27471787/2826 [=================>............] - ETA: 0s - loss: 0.27161928/2826 [===================>..........] - ETA: 0s - loss: 0.27052045/2826 [====================>.........] - ETA: 0s - loss: 0.26902158/2826 [=====================>........] - ETA: 0s - loss: 0.26892292/2826 [=======================>......] - ETA: 0s - loss: 0.26582425/2826 [========================>.....] - ETA: 0s - loss: 0.26502550/2826 [==========================>...] - ETA: 0s - loss: 0.26392688/2826 [===========================>..] - ETA: 0s - loss: 0.26212826/2826 [==============================] - ETA: 0s - loss: 0.26112826/2826 [==============================] - 1s 447us/step - loss: 0.2611 - val_loss: 0.2325
   1/2826 [..............................] - ETA: 2s - loss: 0.0730 133/2826 [>.............................] - ETA: 1s - loss: 0.2213 270/2826 [=>............................] - ETA: 0s - loss: 0.2302 407/2826 [===>..........................] - ETA: 0s - loss: 0.2327 545/2826 [====>.........................] - ETA: 0s - loss: 0.2335 683/2826 [======>.......................] - ETA: 0s - loss: 0.2362 821/2826 [=======>......................] - ETA: 0s - loss: 0.2392 959/2826 [=========>....................] - ETA: 0s - loss: 0.23911099/2826 [==========>...................] - ETA: 0s - loss: 0.24121237/2826 [============>.................] - ETA: 0s - loss: 0.24251371/2826 [=============>................] - ETA: 0s - loss: 0.24081509/2826 [===============>..............] - ETA: 0s - loss: 0.23801649/2826 [================>.............] - ETA: 0s - loss: 0.23921788/2826 [=================>............] - ETA: 0s - loss: 0.23771926/2826 [===================>..........] - ETA: 0s - loss: 0.23782065/2826 [====================>.........] - ETA: 0s - loss: 0.23762206/2826 [======================>.......] - ETA: 0s - loss: 0.23682334/2826 [=======================>......] - ETA: 0s - loss: 0.23592460/2826 [=========================>....] - ETA: 0s - loss: 0.23552599/2826 [==========================>...] - ETA: 0s - loss: 0.23502736/2826 [============================>.] - ETA: 0s - loss: 0.23382826/2826 [==============================] - 1s 427us/step - loss: 0.2341 - val_loss: 0.2260
   1/2826 [..............................] - ETA: 3s - loss: 0.0669 133/2826 [>.............................] - ETA: 1s - loss: 0.2019 271/2826 [=>............................] - ETA: 0s - loss: 0.2109 369/2826 [==>...........................] - ETA: 1s - loss: 0.2126 492/2826 [====>.........................] - ETA: 0s - loss: 0.2219 621/2826 [=====>........................] - ETA: 0s - loss: 0.2268 756/2826 [=======>......................] - ETA: 0s - loss: 0.2314 892/2826 [========>.....................] - ETA: 0s - loss: 0.23431027/2826 [=========>....................] - ETA: 0s - loss: 0.23441169/2826 [===========>..................] - ETA: 0s - loss: 0.23381307/2826 [============>.................] - ETA: 0s - loss: 0.23341445/2826 [==============>...............] - ETA: 0s - loss: 0.22951589/2826 [===============>..............] - ETA: 0s - loss: 0.23041731/2826 [=================>............] - ETA: 0s - loss: 0.22971873/2826 [==================>...........] - ETA: 0s - loss: 0.22822013/2826 [====================>.........] - ETA: 0s - loss: 0.22972154/2826 [=====================>........] - ETA: 0s - loss: 0.23042294/2826 [=======================>......] - ETA: 0s - loss: 0.22852434/2826 [========================>.....] - ETA: 0s - loss: 0.22842574/2826 [==========================>...] - ETA: 0s - loss: 0.22822711/2826 [===========================>..] - ETA: 0s - loss: 0.22742826/2826 [==============================] - 1s 429us/step - loss: 0.2275 - val_loss: 0.2167
   1/2826 [..............................] - ETA: 2s - loss: 0.0626 128/2826 [>.............................] - ETA: 1s - loss: 0.1964 262/2826 [=>............................] - ETA: 0s - loss: 0.2022 399/2826 [===>..........................] - ETA: 0s - loss: 0.2113 533/2826 [====>.........................] - ETA: 0s - loss: 0.2162 668/2826 [======>.......................] - ETA: 0s - loss: 0.2199 804/2826 [=======>......................] - ETA: 0s - loss: 0.2237 946/2826 [=========>....................] - ETA: 0s - loss: 0.22191087/2826 [==========>...................] - ETA: 0s - loss: 0.22131225/2826 [============>.................] - ETA: 0s - loss: 0.22131363/2826 [=============>................] - ETA: 0s - loss: 0.21951503/2826 [==============>...............] - ETA: 0s - loss: 0.21581642/2826 [================>.............] - ETA: 0s - loss: 0.21701781/2826 [=================>............] - ETA: 0s - loss: 0.21561920/2826 [===================>..........] - ETA: 0s - loss: 0.21482060/2826 [====================>.........] - ETA: 0s - loss: 0.21462199/2826 [======================>.......] - ETA: 0s - loss: 0.21402338/2826 [=======================>......] - ETA: 0s - loss: 0.21252478/2826 [=========================>....] - ETA: 0s - loss: 0.21202617/2826 [==========================>...] - ETA: 0s - loss: 0.21142756/2826 [============================>.] - ETA: 0s - loss: 0.21182826/2826 [==============================] - 1s 423us/step - loss: 0.2116 - val_loss: 0.2079
   1/2826 [..............................] - ETA: 2s - loss: 0.0285 131/2826 [>.............................] - ETA: 1s - loss: 0.1859 270/2826 [=>............................] - ETA: 0s - loss: 0.1944 408/2826 [===>..........................] - ETA: 0s - loss: 0.1995 548/2826 [====>.........................] - ETA: 0s - loss: 0.2026 686/2826 [======>.......................] - ETA: 0s - loss: 0.2060 826/2826 [=======>......................] - ETA: 0s - loss: 0.2090 966/2826 [=========>....................] - ETA: 0s - loss: 0.21161107/2826 [==========>...................] - ETA: 0s - loss: 0.21241247/2826 [============>.................] - ETA: 0s - loss: 0.21181388/2826 [=============>................] - ETA: 0s - loss: 0.21001527/2826 [===============>..............] - ETA: 0s - loss: 0.20791667/2826 [================>.............] - ETA: 0s - loss: 0.20871808/2826 [==================>...........] - ETA: 0s - loss: 0.20851948/2826 [===================>..........] - ETA: 0s - loss: 0.20882085/2826 [=====================>........] - ETA: 0s - loss: 0.20822224/2826 [======================>.......] - ETA: 0s - loss: 0.20752364/2826 [========================>.....] - ETA: 0s - loss: 0.20722504/2826 [=========================>....] - ETA: 0s - loss: 0.20802643/2826 [===========================>..] - ETA: 0s - loss: 0.20782782/2826 [============================>.] - ETA: 0s - loss: 0.20752826/2826 [==============================] - 1s 418us/step - loss: 0.2076 - val_loss: 0.2101
   1/2826 [..............................] - ETA: 2s - loss: 0.0296 134/2826 [>.............................] - ETA: 1s - loss: 0.1884 273/2826 [=>............................] - ETA: 0s - loss: 0.1979 413/2826 [===>..........................] - ETA: 0s - loss: 0.2031 552/2826 [====>.........................] - ETA: 0s - loss: 0.2108 690/2826 [======>.......................] - ETA: 0s - loss: 0.2147 829/2826 [=======>......................] - ETA: 0s - loss: 0.2177 968/2826 [=========>....................] - ETA: 0s - loss: 0.21711106/2826 [==========>...................] - ETA: 0s - loss: 0.21801248/2826 [============>.................] - ETA: 0s - loss: 0.21781387/2826 [=============>................] - ETA: 0s - loss: 0.21551527/2826 [===============>..............] - ETA: 0s - loss: 0.21301643/2826 [================>.............] - ETA: 0s - loss: 0.21411741/2826 [=================>............] - ETA: 0s - loss: 0.21291870/2826 [==================>...........] - ETA: 0s - loss: 0.21131997/2826 [====================>.........] - ETA: 0s - loss: 0.21192130/2826 [=====================>........] - ETA: 0s - loss: 0.21142263/2826 [=======================>......] - ETA: 0s - loss: 0.20992402/2826 [========================>.....] - ETA: 0s - loss: 0.20982544/2826 [==========================>...] - ETA: 0s - loss: 0.21002685/2826 [===========================>..] - ETA: 0s - loss: 0.20912825/2826 [============================>.] - ETA: 0s - loss: 0.20872826/2826 [==============================] - 1s 432us/step - loss: 0.2087 - val_loss: 0.2030
   1/2826 [..............................] - ETA: 2s - loss: 0.0245 135/2826 [>.............................] - ETA: 1s - loss: 0.1804 274/2826 [=>............................] - ETA: 0s - loss: 0.1888 412/2826 [===>..........................] - ETA: 0s - loss: 0.1992 551/2826 [====>.........................] - ETA: 0s - loss: 0.2041 689/2826 [======>.......................] - ETA: 0s - loss: 0.2074 828/2826 [=======>......................] - ETA: 0s - loss: 0.2111 968/2826 [=========>....................] - ETA: 0s - loss: 0.21071107/2826 [==========>...................] - ETA: 0s - loss: 0.21191247/2826 [============>.................] - ETA: 0s - loss: 0.21411387/2826 [=============>................] - ETA: 0s - loss: 0.21241530/2826 [===============>..............] - ETA: 0s - loss: 0.21031665/2826 [================>.............] - ETA: 0s - loss: 0.21091805/2826 [==================>...........] - ETA: 0s - loss: 0.21091946/2826 [===================>..........] - ETA: 0s - loss: 0.21122083/2826 [=====================>........] - ETA: 0s - loss: 0.21082227/2826 [======================>.......] - ETA: 0s - loss: 0.21262366/2826 [========================>.....] - ETA: 0s - loss: 0.21312506/2826 [=========================>....] - ETA: 0s - loss: 0.21312648/2826 [===========================>..] - ETA: 0s - loss: 0.21242786/2826 [============================>.] - ETA: 0s - loss: 0.21202826/2826 [==============================] - 1s 422us/step - loss: 0.2122 - val_loss: 0.2043
 1/83 [..............................] - ETA: 2s83/83 [==============================] - 0s 269us/step
fn rate = 0.09999999999999688
tn rate = 0.900000000000045
net accuracy = 0.8366679003493551
fp rate = 0.1633320996506455
tp rate = 0.8366679003493551
epochs = 7
batchsize = 3
latent_space size = 42
latent_space size = 42
